energia/msp432e-core/system/source/ti/drivers/uart/UARTMSP432E4.c
/*
 * Copyright (c) 2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp432e4/inc/msp432.h>

#include <ti/devices/msp432e4/driverlib/uart.h>

#include <ti/drivers/dpl/ClockP.h>
#include <ti/drivers/dpl/HwiP.h>
#include <ti/drivers/dpl/SemaphoreP.h>
#include <ti/drivers/gpio/GPIOMSP432E4.h>
#include <ti/drivers/power/PowerMSP432E4.h>
#include <ti/drivers/uart/UARTMSP432E4.h>

/* UARTMSP432E4 functions */
void         UARTMSP432E4_close(UART_Handle handle);
int_fast16_t UARTMSP432E4_control(UART_Handle handle, uint_fast16_t cmd, void *arg);
void         UARTMSP432E4_init(UART_Handle handle);
UART_Handle  UARTMSP432E4_open(UART_Handle handle, UART_Params *params);
int_fast32_t UARTMSP432E4_read(UART_Handle handle, void *buffer, size_t size);
void         UARTMSP432E4_readCancel(UART_Handle handle);
int_fast32_t UARTMSP432E4_readPolling(UART_Handle handle, void *buffer,
                size_t size);
int_fast32_t UARTMSP432E4_write(UART_Handle handle, const void *buffer,
                size_t size);
void         UARTMSP432E4_writeCancel(UART_Handle handle);
int_fast32_t UARTMSP432E4_writePolling(UART_Handle handle, const void *buffer,
                                   size_t size);

/* Static functions */
static void readBlockingTimeout(uintptr_t arg);
static bool readIsrBinaryBlocking(UART_Handle handle);
static bool readIsrBinaryCallback(UART_Handle handle);
static bool readIsrTextBlocking(UART_Handle handle);
static bool readIsrTextCallback(UART_Handle handle);
static void readSemCallback(UART_Handle handle, void *buffer, size_t count);
static int  readTaskBlocking(UART_Handle handle);
static int  readTaskCallback(UART_Handle handle);
static void writeData(UART_Handle handle);
static void writeSemCallback(UART_Handle handle, void *buffer, size_t count);

static uint_fast16_t getPowerResourceId(uint32_t baseAddr);

/*
 * Function for checking whether flow control is enabled.
 */
static inline bool isFlowControlEnabled(UARTMSP432E4_HWAttrs const  *hwAttrs) {
    return ((hwAttrs->flowControl == UARTMSP432E4_FLOWCTRL_HARDWARE) &&
        (hwAttrs->ctsPin != UARTMSP432E4_PIN_UNASSIGNED) &&
            (hwAttrs->rtsPin != UARTMSP432E4_PIN_UNASSIGNED));
}

/* UART function table for UARTMSP432E4 implementation */
const UART_FxnTable UARTMSP432E4_fxnTable = {
    UARTMSP432E4_close,
    UARTMSP432E4_control,
    UARTMSP432E4_init,
    UARTMSP432E4_open,
    UARTMSP432E4_read,
    UARTMSP432E4_readPolling,
    UARTMSP432E4_readCancel,
    UARTMSP432E4_write,
    UARTMSP432E4_writePolling,
    UARTMSP432E4_writeCancel
};

static const uint32_t dataLength[] = {
    UART_CONFIG_WLEN_5,     /* UART_LEN_5 */
    UART_CONFIG_WLEN_6,     /* UART_LEN_6 */
    UART_CONFIG_WLEN_7,     /* UART_LEN_7 */
    UART_CONFIG_WLEN_8      /* UART_LEN_8 */
};

static const uint32_t stopBits[] = {
    UART_CONFIG_STOP_ONE,   /* UART_STOP_ONE */
    UART_CONFIG_STOP_TWO    /* UART_STOP_TWO */
};

static const uint32_t parityType[] = {
    UART_CONFIG_PAR_NONE,   /* UART_PAR_NONE */
    UART_CONFIG_PAR_EVEN,   /* UART_PAR_EVEN */
    UART_CONFIG_PAR_ODD,    /* UART_PAR_ODD */
    UART_CONFIG_PAR_ZERO,   /* UART_PAR_ZERO */
    UART_CONFIG_PAR_ONE     /* UART_PAR_ONE */
};

/*
 *  ======== staticFxnTable ========
 *  This is a function lookup table to simplify the UART driver modes.
 */
static const UARTMSP432E4_FxnSet staticFxnTable[2][2] = {
    {/* UART_MODE_BLOCKING */
        {/* UART_DATA_BINARY */
            .readIsrFxn  = readIsrBinaryBlocking,
            .readTaskFxn = readTaskBlocking
        },
        {/* UART_DATA_TEXT */
            .readIsrFxn  = readIsrTextBlocking,
            .readTaskFxn = readTaskBlocking
        }
    },
    {/* UART_MODE_CALLBACK */
        {/* UART_DATA_BINARY */
            .readIsrFxn  = readIsrBinaryCallback,
            .readTaskFxn = readTaskCallback

        },
        {/* UART_DATA_TEXT */
            .readIsrFxn  = readIsrTextCallback,
            .readTaskFxn = readTaskCallback,
        }
    }
};

/*
 *  ======== UARTMSP432E4_close ========
 */
void UARTMSP432E4_close(UART_Handle handle)
{
    UARTMSP432E4_Object           *object = handle->object;
    UARTMSP432E4_HWAttrs const    *hwAttrs = handle->hwAttrs;
    uint_fast16_t                  resourceId;
    uint8_t                        port;

    /* Disable UART and interrupts. */
    UARTIntDisable(hwAttrs->baseAddr, UART_INT_TX | UART_INT_RX | UART_INT_RT |
         UART_INT_OE | UART_INT_BE | UART_INT_PE | UART_INT_FE);
    UARTDisable(hwAttrs->baseAddr);

    resourceId = getPowerResourceId(hwAttrs->baseAddr);
    if (resourceId < PowerMSP432E4_NUMRESOURCES) {
        Power_releaseDependency(resourceId);
    }

    /* Remove dependencies on GPIO ports */
    GPIOMSP432E4_undoPinConfig(hwAttrs->txPin);
    port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->txPin);
    Power_releaseDependency(GPIOMSP432E4_getPowerResourceId(port));

    GPIOMSP432E4_undoPinConfig(hwAttrs->rxPin);
    port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->rxPin);
    Power_releaseDependency(GPIOMSP432E4_getPowerResourceId(port));

