energia/msp432e-core/system/source/ti/drivers/uart/UARTMSP432E4.c
    if (isFlowControlEnabled(hwAttrs)) {
        GPIOMSP432E4_undoPinConfig(hwAttrs->ctsPin);
        port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->ctsPin);
        Power_releaseDependency(GPIOMSP432E4_getPowerResourceId(port));

        GPIOMSP432E4_undoPinConfig(hwAttrs->rtsPin);
        port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->rtsPin);
        Power_releaseDependency(GPIOMSP432E4_getPowerResourceId(port));
    }

    if (object->hwi) {
        HwiP_delete(object->hwi);
    }

    if (object->writeSem) {
        SemaphoreP_delete(object->writeSem);
    }

    if (object->readSem) {
        SemaphoreP_delete(object->readSem);
    }

    if (object->timeoutClk) {
        ClockP_delete(object->timeoutClk);
    }

    object->state.opened = false;
}

/*
 *  ======== UARTMSP432E4_control ========
 *  @pre    Function assumes that the handle is not NULL
 */
int_fast16_t UARTMSP432E4_control(UART_Handle handle, uint_fast16_t cmd, void *arg)
{
    UARTMSP432E4_Object         *object = handle->object;
    UARTMSP432E4_HWAttrs const  *hwAttrs = handle->hwAttrs;
    unsigned char                data;
    int                          bufferCount;

    bufferCount = RingBuf_peek(&object->ringBuffer, &data);

    switch (cmd) {
        /* Common UART CMDs */
        case (UART_CMD_PEEK):
            *(int *)arg = (bufferCount) ? data : UART_ERROR;
            return (UART_STATUS_SUCCESS);

        case (UART_CMD_ISAVAILABLE):
            *(bool *)arg = (bufferCount != 0);
            return (UART_STATUS_SUCCESS);

        case (UART_CMD_GETRXCOUNT):
            *(int *)arg = bufferCount;
            return (UART_STATUS_SUCCESS);

        case (UART_CMD_RXENABLE):
            if (!object->state.rxEnabled) {
                UARTIntEnable(hwAttrs->baseAddr, UART_INT_RX | UART_INT_RT);
                object->state.rxEnabled = true;
                return (UART_STATUS_SUCCESS);
            }
            return (UART_STATUS_ERROR);

        case (UART_CMD_RXDISABLE):
            if (object->state.rxEnabled) {
                UARTIntDisable(hwAttrs->baseAddr, UART_INT_RX | UART_INT_RT);
                object->state.rxEnabled = false;
                return (UART_STATUS_SUCCESS);
            }
            return (UART_STATUS_ERROR);

        default:
            return (UART_STATUS_UNDEFINEDCMD);
    }
}

/*
 *  ======== UARTMSP432E4_hwiIntFxn ========
 *  Hwi function that processes UART interrupts.
 *
 *  @param(arg)         The UART_Handle for this Hwi.
 */
static void UARTMSP432E4_hwiIntFxn(uintptr_t arg)
{
    uint32_t                   status;
    UARTMSP432E4_Object           *object = ((UART_Handle)arg)->object;
    UARTMSP432E4_HWAttrs const    *hwAttrs = ((UART_Handle)arg)->hwAttrs;
    uint32_t                   rxErrors;

    /* Clear interrupts */
    status = UARTIntStatus(hwAttrs->baseAddr, true);
    UARTIntClear(hwAttrs->baseAddr, status);

    if (status & (UART_INT_RX | UART_INT_RT | UART_INT_OE | UART_INT_BE |
            UART_INT_PE | UART_INT_FE)) {
        object->readFxns.readIsrFxn((UART_Handle)arg);
    }

    /* Reading the data from the FIFO doesn't mean we caught an overrrun! */
    rxErrors = UARTRxErrorGet(hwAttrs->baseAddr);
    if (rxErrors) {
        UARTRxErrorClear(hwAttrs->baseAddr);
        if (hwAttrs->errorFxn) {
            hwAttrs->errorFxn((UART_Handle)arg, rxErrors);
        }
    }

    if (status & UART_INT_TX) {
        writeData((UART_Handle)arg);
    }
}

/*
 *  ======== UARTMSP432E4_init ========
 */
void UARTMSP432E4_init(UART_Handle handle)
{
}

/*
 *  ======== UARTMSP432E4_open ========
 */
UART_Handle UARTMSP432E4_open(UART_Handle handle, UART_Params *params)
{
    uintptr_t                   key;
    ClockP_FreqHz               freq;
    UARTMSP432E4_Object        *object = handle->object;
    UARTMSP432E4_HWAttrs const *hwAttrs = handle->hwAttrs;
    union {
        HwiP_Params             hwiParams;
        ClockP_Params           clockParams;
    } paramsUnion;
    uint8_t                     pin;
    uint32_t                    port;
    uint32_t                    pinMap;
    uint_fast16_t               resourceId;

    key = HwiP_disable();

    if (object->state.opened) {
        HwiP_restore(key);
        return (NULL);
    }
    object->state.opened = true;

    HwiP_restore(key);

    object->state.readMode       = params->readMode;
    object->state.writeMode      = params->writeMode;
    object->state.readReturnMode = params->readReturnMode;
    object->state.readDataMode   = params->readDataMode;
    object->state.writeDataMode  = params->writeDataMode;
    object->state.readEcho       = params->readEcho;
    object->readTimeout          = params->readTimeout;
    object->writeTimeout         = params->writeTimeout;
    object->readCallback         = params->readCallback;
    object->writeCallback        = params->writeCallback;
    object->baudRate             = params->baudRate;
    object->stopBits             = params->stopBits;
    object->dataLength           = params->dataLength;
    object->parityType           = params->parityType;
    object->readFxns =
        staticFxnTable[object->state.readMode][object->state.readDataMode];

    /* Set UART variables to defaults. */
    object->writeBuf             = NULL;
    object->readBuf              = NULL;
    object->writeCount           = 0;
    object->readCount            = 0;
    object->writeSize            = 0;
    object->readSize             = 0;

    object->readSem = NULL;
    object->writeSem = NULL;
    object->hwi = NULL;
    object->timeoutClk = NULL;

    RingBuf_construct(&object->ringBuffer, hwAttrs->ringBufPtr,
            hwAttrs->ringBufSize);

    HwiP_Params_init(&paramsUnion.hwiParams);
    paramsUnion.hwiParams.arg = (uintptr_t)handle;
    paramsUnion.hwiParams.priority = hwAttrs->intPriority;

    resourceId = getPowerResourceId(hwAttrs->baseAddr);
    if (resourceId > PowerMSP432E4_NUMRESOURCES) {
        return (NULL);
    }

    Power_setDependency(resourceId);

    /* Configure the TX pin */
    pin = GPIOMSP432E4_getPinFromPinConfig(hwAttrs->txPin);
    port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->txPin);
    pinMap = GPIOMSP432E4_getPinMapFromPinConfig(hwAttrs->txPin);

