energia/msp432e-core/system/source/ti/drivers/uart/UARTMSP432E4.c
    Power_setDependency(GPIOMSP432E4_getPowerResourceId(port));
    GPIOPinConfigure(pinMap);
    GPIOPinTypeUART(GPIOMSP432E4_getGpioBaseAddr(port), pin);

    /* Configure the RX pin */
    pin = GPIOMSP432E4_getPinFromPinConfig(hwAttrs->rxPin);
    port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->rxPin);
    pinMap = GPIOMSP432E4_getPinMapFromPinConfig(hwAttrs->rxPin);

    Power_setDependency(GPIOMSP432E4_getPowerResourceId(port));
    GPIOPinConfigure(pinMap);
    GPIOPinTypeUART(GPIOMSP432E4_getGpioBaseAddr(port), pin);

    /* Configure flow control pins if enabled */
    if (isFlowControlEnabled(hwAttrs)) {
        pin = GPIOMSP432E4_getPinFromPinConfig(hwAttrs->ctsPin);
        port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->ctsPin);
        pinMap = GPIOMSP432E4_getPinMapFromPinConfig(hwAttrs->ctsPin);

        Power_setDependency(GPIOMSP432E4_getPowerResourceId(port));
        GPIOPinConfigure(pinMap);
        GPIOPinTypeUART(GPIOMSP432E4_getGpioBaseAddr(port), pin);

        pin = GPIOMSP432E4_getPinFromPinConfig(hwAttrs->rtsPin);
        port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->rtsPin);
        pinMap = GPIOMSP432E4_getPinMapFromPinConfig(hwAttrs->rtsPin);

        Power_setDependency(GPIOMSP432E4_getPowerResourceId(port));
        GPIOPinConfigure(pinMap);
        GPIOPinTypeUART(GPIOMSP432E4_getGpioBaseAddr(port), pin);

        /* Set flow control */
        UARTFlowControlSet(hwAttrs->baseAddr,
                UART_FLOWCONTROL_TX | UART_FLOWCONTROL_RX);
    }
    else {
        /* Disable hardware flow control */
        UARTFlowControlSet(hwAttrs->baseAddr, UART_FLOWCONTROL_NONE);
    }

    object->hwi = HwiP_create(hwAttrs->intNum, UARTMSP432E4_hwiIntFxn,
            &paramsUnion.hwiParams);

    if (object->hwi == NULL) {
        UARTMSP432E4_close(handle);
        return (NULL);
    }

    /* If write mode is blocking create a semaphore and set callback. */
    if (object->state.writeMode == UART_MODE_BLOCKING) {
        object->writeSem = SemaphoreP_createBinary(0);
        if (object->writeSem == NULL) {
            UARTMSP432E4_close(handle);
            return (NULL);
        }
        object->writeCallback = &writeSemCallback;
    }

    /* If read mode is blocking create a semaphore and set callback. */
    if (object->state.readMode == UART_MODE_BLOCKING) {
        object->readSem = SemaphoreP_createBinary(0);
        if (object->readSem == NULL) {
            UARTMSP432E4_close(handle);
            return (NULL);
        }
        object->readCallback = &readSemCallback;

        ClockP_Params_init(&paramsUnion.clockParams);
        paramsUnion.clockParams.period = 0;
        paramsUnion.clockParams.startFlag = false;
        paramsUnion.clockParams.arg = (uintptr_t)handle;
        object->timeoutClk = ClockP_create((ClockP_Fxn)&readBlockingTimeout,
                0 /* timeout */, &(paramsUnion.clockParams));
        if (object->timeoutClk == NULL) {
            UARTMSP432E4_close(handle);
            return (NULL);
        }
    }
    else {
        object->state.drainByISR = false;
    }

    /* Enable UART and its interrupt. */
    UARTIntClear(hwAttrs->baseAddr, UART_INT_TX | UART_INT_RX | UART_INT_RT);
    UARTEnable(hwAttrs->baseAddr);

    UARTFIFOLevelSet(hwAttrs->baseAddr, UART_FIFO_TX1_8, UART_FIFO_RX1_8);

    ClockP_getCpuFreq(&freq);
    UARTConfigSetExpClk(hwAttrs->baseAddr, freq.lo, params->baudRate,
        dataLength[params->dataLength] | stopBits[params->stopBits] |
        parityType[params->parityType]);

    UARTIntEnable(hwAttrs->baseAddr, UART_INT_RX | UART_INT_RT | UART_INT_OE |
        UART_INT_BE | UART_INT_PE | UART_INT_FE);

    /* Return the handle */
    return (handle);
}

/*
 *  ======== UARTMSP432E4_read ========
 */
int_fast32_t UARTMSP432E4_read(UART_Handle handle, void *buffer, size_t size)
{
    uintptr_t               key;
    UARTMSP432E4_Object    *object = handle->object;

    key = HwiP_disable();

    if ((object->state.readMode == UART_MODE_CALLBACK) && object->readSize) {
        HwiP_restore(key);

        return (UART_ERROR);
    }

    /* Save the data to be read and restore interrupts. */
    object->readBuf = buffer;
    object->readSize = size;
    object->readCount = size;

    HwiP_restore(key);

    return ((int_fast32_t)(object->readFxns.readTaskFxn(handle)));
}

/*
 *  ======== UARTMSP432E4_readCancel ========
 */
void UARTMSP432E4_readCancel(UART_Handle handle)
{
    uintptr_t               key;
    UARTMSP432E4_Object    *object = handle->object;

    if ((object->state.readMode != UART_MODE_CALLBACK) ||
        (object->readSize == 0)) {
        return;
    }

    key = HwiP_disable();

    object->state.drainByISR = false;
    /*
     * Indicate that what we've currently received is what we asked for so that
     * the existing logic handles the completion.
     */
    object->readSize -= object->readCount;
    object->readCount = 0;

    HwiP_restore(key);

    object->readFxns.readTaskFxn(handle);
}

/*
 *  ======== UARTMSP432E4_readPolling ========
 */
int_fast32_t UARTMSP432E4_readPolling(UART_Handle handle, void *buf, size_t size)
{
    int_fast32_t                count = 0;
    UARTMSP432E4_Object        *object = handle->object;
    UARTMSP432E4_HWAttrs const *hwAttrs = handle->hwAttrs;
    unsigned char              *buffer = (unsigned char *)buf;

    /* Read characters. */
    while (size) {
        /* Grab data from the RingBuf before getting it from the RX data reg */
        UARTIntDisable(hwAttrs->baseAddr, UART_INT_RX | UART_INT_RT);
        if (RingBuf_get(&object->ringBuffer, buffer) == -1) {
            *buffer = UARTCharGet(hwAttrs->baseAddr);
        }
        if (object->state.rxEnabled) {
            UARTIntEnable(hwAttrs->baseAddr, UART_INT_RX | UART_INT_RT);
        }

        count++;
        size--;

        if (object->state.readDataMode == UART_DATA_TEXT && *buffer == '\r') {
            /* Echo character if enabled. */
            if (object->state.readEcho) {
                UARTCharPut(hwAttrs->baseAddr, '\r');
            }
            *buffer = '\n';
        }

        /* Echo character if enabled. */
        if (object->state.readDataMode == UART_DATA_TEXT &&
                object->state.readEcho) {
            UARTCharPut(hwAttrs->baseAddr, *buffer);
        }

