energia/msp432e-core/system/source/ti/drivers/uart/UARTMSP432E4.c
        /* If read return mode is newline, finish if a newline was received. */
        if (object->state.readDataMode == UART_DATA_TEXT &&
                object->state.readReturnMode == UART_RETURN_NEWLINE &&
                *buffer == '\n') {
            return (count);
        }

        buffer++;
    }

    return (count);
}

/*
 *  ======== UARTMSP432E4_write ========
 */
int_fast32_t UARTMSP432E4_write(UART_Handle handle, const void *buffer, size_t size)
{
    uintptr_t                   key;
    UARTMSP432E4_Object        *object = handle->object;
    UARTMSP432E4_HWAttrs const *hwAttrs = handle->hwAttrs;

    if (!size) {
        return 0;
    }

    key = HwiP_disable();

    if (object->writeCount) {
        HwiP_restore(key);
        return (UART_ERROR);
    }

    /* Save the data to be written and restore interrupts. */
    object->writeBuf = buffer;
    object->writeSize = size;
    object->writeCount = size;

    HwiP_restore(key);

    if (!(UARTIntStatus(hwAttrs->baseAddr, false) & UART_INT_TX)) {
        /*
         *  Start the transfer going if the raw interrupt status TX bit
         *  is 0.  This will cause the ISR to fire when we enable
         *  UART_INT_TX.  If the RIS TX bit is not cleared, we don't
         *  need to call writeData(), since the ISR will fire once we
         *  enable the interrupt, causing the transfer to start.
         */
        writeData(handle);
    }
    if (object->writeCount) {
        UARTTxIntModeSet(hwAttrs->baseAddr, UART_TXINT_MODE_FIFO);
        UARTIntEnable(hwAttrs->baseAddr, UART_INT_TX);
    }

    /* If writeMode is blocking, block and get the state. */
    if (object->state.writeMode == UART_MODE_BLOCKING) {
        /* Pend on semaphore and wait for Hwi to finish. */
        if (SemaphoreP_pend(object->writeSem, object->writeTimeout) !=
                SemaphoreP_OK) {
            /* Semaphore timed out, make the write empty and log the write. */
            UARTIntDisable(hwAttrs->baseAddr, UART_INT_TX);
            UARTIntClear(hwAttrs->baseAddr, UART_INT_TX);
            object->writeCount = 0;
        }
        return ((int_fast32_t)(object->writeSize - object->writeCount));
    }

    return (0);
}

/*
 *  ======== UARTMSP432E4_writeCancel ========
 */
void UARTMSP432E4_writeCancel(UART_Handle handle)
{
    uintptr_t                    key;
    UARTMSP432E4_Object         *object = handle->object;
    UARTMSP432E4_HWAttrs const  *hwAttrs = handle->hwAttrs;
    unsigned int                 written;

    key = HwiP_disable();

    /* Return if there is no write. */
    if (!object->writeCount) {
        HwiP_restore(key);
        return;
    }

    /* Set size = 0 to prevent writing and restore interrupts. */
    written = object->writeCount;
    object->writeCount = 0;
    UARTIntDisable(hwAttrs->baseAddr, UART_INT_TX);
    UARTIntClear(hwAttrs->baseAddr, UART_INT_TX);

    HwiP_restore(key);

    /* Reset the write buffer so we can pass it back */
    object->writeCallback(handle, (void *)object->writeBuf,
        object->writeSize - written);
}

/*
 *  ======== UARTMSP432E4_writePolling ========
 */
int_fast32_t UARTMSP432E4_writePolling(UART_Handle handle, const void *buf, size_t size)
{
    int_fast32_t                count = 0;
    UARTMSP432E4_Object        *object = handle->object;
    UARTMSP432E4_HWAttrs const *hwAttrs = handle->hwAttrs;
    unsigned char              *buffer = (unsigned char *)buf;

    /* Write characters. */
    while (size) {
        if (object->state.writeDataMode == UART_DATA_TEXT && *buffer == '\n') {
            UARTCharPut(hwAttrs->baseAddr, '\r');
            count++;
        }
        UARTCharPut(hwAttrs->baseAddr, *buffer);

        buffer++;
        count++;
        size--;
    }

    while (UARTBusy(hwAttrs->baseAddr)) {
        ;
    }

    return (count);
}

/*
 *  ======== getPowerResourceId ========
 */
static uint_fast16_t getPowerResourceId(uint32_t baseAddr)
{
    switch (baseAddr) {
        case UART0_BASE:
            return (PowerMSP432E4_PERIPH_UART0);
        case UART1_BASE:
            return (PowerMSP432E4_PERIPH_UART1);
        case UART2_BASE:
            return (PowerMSP432E4_PERIPH_UART2);
        case UART3_BASE:
            return (PowerMSP432E4_PERIPH_UART3);
        case UART4_BASE:
            return (PowerMSP432E4_PERIPH_UART4);
        case UART5_BASE:
            return (PowerMSP432E4_PERIPH_UART5);
        case UART6_BASE:
            return (PowerMSP432E4_PERIPH_UART6);
        case UART7_BASE:
            return (PowerMSP432E4_PERIPH_UART7);
        default:
            return ((uint_fast16_t)(~0));
    }
}


/*
 *  ======== readBlockingTimeout ========
 */
static void readBlockingTimeout(uintptr_t arg)
{
    UARTMSP432E4_Object *object = ((UART_Handle)arg)->object;
    object->state.bufTimeout = true;
    SemaphoreP_post(object->readSem);
}

/*
 *  ======== readIsrBinaryBlocking ========
 *  Function that is called by the ISR
 */
static bool readIsrBinaryBlocking(UART_Handle handle)
{
    UARTMSP432E4_Object           *object = handle->object;
    UARTMSP432E4_HWAttrs const    *hwAttrs = handle->hwAttrs;
    int32_t                        readIn;

    readIn = UARTCharGetNonBlocking(hwAttrs->baseAddr);
    while (readIn != -1) {
        /*
         *  Bits 0-7 contain the data, bits 8-11 are used for error codes.
         *  (Bits 12-31 are reserved and read as 0)  If readIn > 0xFF, an
         *  error has occurred.
         */
        if (readIn > 0xFF) {
            if (hwAttrs->errorFxn) {
                hwAttrs->errorFxn(handle, (uint32_t)((readIn >> 8) & 0xF));
            }
            UARTRxErrorClear(hwAttrs->baseAddr);
            return (false);
        }

        if (RingBuf_put(&object->ringBuffer, (unsigned char)readIn) == -1) {
            return (false);
        }

        if (object->state.callCallback) {
            object->state.callCallback = false;
            object->readCallback(handle, NULL, 0);
        }
        readIn = UARTCharGetNonBlocking(hwAttrs->baseAddr);
    }
    return (true);
}

