energia/msp432e-core/system/source/ti/drivers/uart/UARTMSP432E4.c
/*
 *  ======== writeData ========
 */
static void writeData(UART_Handle handle)
{
    UARTMSP432E4_Object        *object = handle->object;
    UARTMSP432E4_HWAttrs const *hwAttrs = handle->hwAttrs;
    unsigned char              *writeOffset;

    writeOffset = (unsigned char *)object->writeBuf +
        object->writeSize * sizeof(unsigned char);
    while (object->writeCount) {
        if (!UARTCharPutNonBlocking(hwAttrs->baseAddr,
                *(writeOffset - object->writeCount))) {
            /* TX FIFO is FULL */
            break;
        }
        if ((object->state.writeDataMode == UART_DATA_TEXT) &&
            (*(writeOffset - object->writeCount) == '\n')) {
            UARTCharPut(hwAttrs->baseAddr, '\r');
        }
        object->writeCount--;
    }

    if (!object->writeCount) {
        UARTIntDisable(hwAttrs->baseAddr, UART_INT_TX);
        UARTIntClear(hwAttrs->baseAddr, UART_INT_TX);

        /*
         *  Set TX interrupt for end of transmission mode.
         *  The TXRIS bit will be set only when all the data
         *  (including stop bits) have left the serializer.
         */
        UARTTxIntModeSet(hwAttrs->baseAddr, UART_TXINT_MODE_EOT);

        if (!UARTBusy(hwAttrs->baseAddr)) {
            object->writeCallback(handle, (void *)object->writeBuf,
                    object->writeSize);
        }
        else {
            UARTIntEnable(hwAttrs->baseAddr, UART_INT_TX);
        }
    }
}

/*
 *  ======== writeSemCallback ========
 *  Simple callback to post a semaphore for the blocking mode.
 */
static void writeSemCallback(UART_Handle handle, void *buffer, size_t count)
{
    UARTMSP432E4_Object *object = handle->object;

    SemaphoreP_post(object->writeSem);
}
